# ListSchemas Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Schema..::..ListSchemas Method
Schema Class See Also
---
Lists all schemas in memory.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static IList<Schema> ListSchemas()
```

Visual Basic
---
```text
Public Shared Function ListSchemas As IList(Of Schema)
```

Visual C++
---
```text
public:
static IList<Schema^>^ ListSchemas()
```

# See Also
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace